treysiz/esp32-printer-client/sdkconfig.defaults
# ESP32 Printer Client - SDK Configuration Defaults
# For ESP-IDF v5.x / ESP32-S3
# These are applied automatically at build time if sdkconfig does not exist.

# ── Target ──────────────────────────────────────────────────────────────
CONFIG_IDF_TARGET="esp32s3"

# ── WiFi ────────────────────────────────────────────────────────────────
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_TX_BUFFER_TYPE_DYNAMIC=y
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y

# ── TCP/IP Stack (LwIP) ──────────────────────────────────────────────────
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=5744
CONFIG_LWIP_TCP_WND_DEFAULT=5744
CONFIG_LWIP_TCP_RECVMBOX_SIZE=6
CONFIG_LWIP_UDP_RECVMBOX_SIZE=6
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=32
CONFIG_LWIP_TCPIP_TASK_STACK_SIZE=3072

# ── HTTPS / TLS (backend "WiFi 拉单") ────────────────────────────────────
# Bundle of common root CAs so https:// backend URLs validate out of the box.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
CONFIG_ESP_TLS_INSECURE=n

# ── SPI RAM (PSRAM) — OPTIONAL ───────────────────────────────────────────
# ⚠⚠ 这一节原来标着 "OPTIONAL" 且默认没开 —— **那是错的**。实测后果：
#     心跳正常、测打印正常、**真订单小票收不下** ⇒ 订单进、票不出、日志全绿。
#     （2026-09-13 上云配打印机时查出来的，第一单真来了才会暴露。）
#
# 为什么必须开：轮询用 ?limit=1&encoding=base64，535 张真实小票实测
#   base64 响应中位数 ~137 KB、上限 ~210 KB（见 http_client.c 顶部注释）。
#   没有 PSRAM 时缓冲被压到 HTTP_RESP_INTERNAL_MAX = 48 KB
#   （内部 RAM 开大了会饿死 TLS 握手 → -0x7F00），根本装不下。
#   http_client.c 里那句写得很清楚：
#     "A board without PSRAM can reach the backend but cannot receive a real receipt."
#
# ⚠ MODE 必须和模组对上（选错开不了机）。**换模组前先跑一次**：
#     esptool --chip esp32s3 -p COM3 flash_id
#   这块板报的是 "Embedded PSRAM 8MB (AP_3v3)" ⇒ N8R8/N16R8 那一类，octal。
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
# 小块仍走内部 RAM（更快）；只有 big_malloc 那种大块才落 PSRAM
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384

# ── NVS ─────────────────────────────────────────────────────────────────
CONFIG_NVS_ENCRYPTION=n

# ── FreeRTOS ─────────────────────────────────────────────────────────────
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK=y

# ── Logging ──────────────────────────────────────────────────────────────
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3

# ── Heap / Memory ────────────────────────────────────────────────────────
CONFIG_ESP_SYSTEM_CHECK_INT_LEVEL_5=y

# ── Partition table ──────────────────────────────────────────────────────
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# ── ESP-NETIF ────────────────────────────────────────────────────────────
CONFIG_ESP_NETIF_IP_LOST_TIMER_INTERVAL=120
